Конфигурация/Documents/Распоряжение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Распоряжение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид подчиненного документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийБэкОфиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРазмещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыплатыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиВыплатыПроцентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетВозвратаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоВостребования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавкаПриДосрочномЗакрытии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субординированность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржевой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодОжидаемыйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Распоряжение/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента") Тогда
		Оповестить("РаспоряженияНаРазмещениеДепозитов.Обновить");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РассчитатьСрокРазмещения();
	
	РеквизитыИсполнителя = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет");

	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные", РеквизитыИсполнителя) Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента") Тогда
	
		РеквизитыИсполнителя.РасчетныйСчет = Объект.РасчетныйСчетВозвратаДенежныхСредств;
		
		Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные", РеквизитыИсполнителя) Тогда
			Объект.РасчетныйСчетВозвратаДенежныхСредств = Неопределено;	
		КонецЕсли;
		
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаПриИзменении(Элемент)
	
	РассчитатьСрокРазмещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРазмещенияПриИзменении(Элемент)
	
	РассчитатьСрокРазмещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
			
	НастроитьВидимостьИДоступность(ЭтаФорма);
	РассчитатьСрокРазмещения();

КонецПроцедуры

&НаКлиенте
Процедура ДоВостребованияПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчет);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента") Тогда
		
		РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчетВозвратаДенежныхСредств);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		
		ТекВалюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
	
		Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ТекВалюта Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта [" + Объект.Валюта + "] на [" + ТекВалюта + "] из расчетного счета.");
						
		КонецЕсли;
				
		Объект.Валюта = ТекВалюта;
		
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВалютаВыбранногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Валюта");
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетВозвратаДенежныхСредств) Тогда
		
		ВалютаРасчетногоСчетаВозвратаДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетВозвратаДенежныхСредств, "Валюта");
			
		Если ВалютаРасчетногоСчетаВозвратаДС <> ВалютаВыбранногоСчета Тогда
			
			Если Вопрос("Валюта [" + ВалютаРасчетногоСчетаВозвратаДС + "] расчетного счета возврата денежных средств не соответствует валюте [" + ВалютаВыбранногоСчета + "] расчетного счёта [" + ВыбранноеЗначение + "]. Расчетный счёт возврата денежных средств будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.РасчетныйСчетВозвратаДенежныхСредств = Неопределено;			
			Иначе
				ВыбранноеЗначение = Объект.РасчетныйСчет;			
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетВозвратаДенежныхСредствПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетВозвратаДенежныхСредств) Тогда
		
		ВалютаРасчетногоСчетаВозвратаДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетВозвратаДенежныхСредств, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
			
			ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
			
			Если ВалютаРасчетногоСчетаВозвратаДС <> ВалютаРасчетногоСчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта [" + ВалютаРасчетногоСчетаВозвратаДС + "] расчетного счета [" + Объект.РасчетныйСчетВозвратаДенежныхСредств + "] отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета.",,, "Объект.РасчетныйСчетВозвратаДенежныхСредств");
				Объект.РасчетныйСчетВозвратаДенежныхСредств = Неопределено;
			КонецЕсли;
			
		Иначе
				
			Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчетаВозвратаДС Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта [" + Объект.Валюта + "] на [" + ВалютаРасчетногоСчетаВозвратаДС + "] из расчетного счета возврата денежных средств.");
							
			КонецЕсли;
			
			Объект.Валюта = ВалютаРасчетногоСчетаВозвратаДС;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БиржевойПриИзменении(Элемент)

	Объект.РасчетныйСчет						= Неопределено;
	Объект.РасчетныйСчетВозвратаДенежныхСредств	= Неопределено;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
			
	Если Не ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		РасчетныйСчетПриИзменении(Неопределено);
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, Ложь);
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда 
		
		ТекРасчетныйСчет = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РасчетныйСчет, "Валюта, ДоговорМНО");
		
		Если ЗначениеЗаполнено(Объект.РасчетныйСчетВозвратаДенежныхСредств) Тогда

			ВалютаРасчетногоСчетаВозвратаДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетВозвратаДенежныхСредств, "Валюта");
			
			Если ТекРасчетныйСчет.Валюта <> ВалютаРасчетногоСчетаВозвратаДС Тогда	
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Расчетный счет возврата денежных средств был очищен, т.к. валюта [" + ВалютаРасчетногоСчетаВозвратаДС + "] отличается от валюты [" 
					+ ТекРасчетныйСчет.Валюта + "] расчетного счета списания денежных средств.",,, "Объект.РасчетныйСчетПолучатель");
				
				Объект.РасчетныйСчетВозвратаДенежныхСредств = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьИсполнителяВозвратаДенежныхСредств(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, Ложь, Новый Структура("РасчетныйСчет", "РасчетныйСчетВозвратаДенежныхСредств"));

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте
Процедура РассчитатьСрокРазмещения()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента") Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаРазмещения) И ЗначениеЗаполнено(Объект.ДатаВозврата) Тогда
			
			Если НачалоДня(Объект.Дата) > Объект.ДатаРазмещения Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата размещения [" + Формат(Объект.ДатаРазмещения, "ДФ=dd.MM.yyyy") + "] не может быть меньше даты документа.",, "Объект.ДатаРазмещения");
				Объект.ДатаРазмещения = Неопределено;
				
			КонецЕсли;
			
			ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.ДатаРазмещения);
		Иначе
			ЭтаФорма.Срок = 0;	
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаВозврата) Тогда 
		
		ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.Дата);
		
	Иначе
		
		ЭтаФорма.Срок = 0;
	   
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента") Тогда
		ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.ДатаРазмещения);
	Иначе
		ЭтаФорма.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Объект.ДатаВозврата, Объект.Дата);
	КонецЕсли;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ВидНумерацииРаспоряжения = ПолучитьВидНумерацииОбъектовНаСервере(Объект.Ссылка, Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Банк, Объект.ВидОперации); 
	
		Если ЗначениеЗаполнено(ВидНумерацииРаспоряжения) Тогда 
			
			ЭтаФорма.НомерПодтверждения = ПолучитьНомерПодтвержденияНаСерврере(
											Объект.Организация,
											ВидНумерацииРаспоряжения,
											Объект.Ссылка,
											Объект.СчетДоверительногоУправления,
											Объект.Дата);
											
		КонецЕсли;
										
	КонецЕсли;
	
	Если Не ЭтаФорма.ТолькоПросмотр И Объект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		
		Если РольДоступна("ПолныеПрава") 
			Или Не ЗначениеЗаполнено(ЭтаФорма.НомерПодтверждения) И РольДоступна("ОперацииФронтОфисаУправляющейКомпании") Тогда 
			
			ЭтаФорма.ТолькоПросмотр = Ложь;
		Иначе
	    	ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	ЭтоРаспоряжениеНаРазмещениеДепозита = (ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента"));
	
	Элементы.ГруппаРеквизитыДепозита.Видимость = ЭтоРаспоряжениеНаРазмещениеДепозита;
	Элементы.ГруппаСчетИсполнительВозврата.Видимость = ЭтоРаспоряжениеНаРазмещениеДепозита;
	Элементы.ПодОжидаемоеПоступлениеДенежныхСредств.Видимость = Не ЭтоРаспоряжениеНаРазмещениеДепозита;
	
	Элементы.Банк.ОтметкаНезаполненного									= Ложь;
	Элементы.ДатаРазмещения.ОтметкаНезаполненного						= Ложь;
	Элементы.ПериодичностьВыплатыПроцентов.ОтметкаНезаполненного		= Ложь;
	Элементы.РасчетныйСчет.ОтметкаНезаполненного						= Ложь;
	Элементы.РасчетныйСчетВозвратаДенежныхСредств.ОтметкаНезаполненного	= Ложь;	
	
	Элементы.Банк.АвтоОтметкаНезаполненного									= ЭтоРаспоряжениеНаРазмещениеДепозита;
	Элементы.ДатаРазмещения.АвтоОтметкаНезаполненного						= ЭтоРаспоряжениеНаРазмещениеДепозита;
	Элементы.ПериодичностьВыплатыПроцентов.АвтоОтметкаНезаполненного		= ЭтоРаспоряжениеНаРазмещениеДепозита;
	Элементы.РасчетныйСчет.АвтоОтметкаНезаполненного						= ЭтоРаспоряжениеНаРазмещениеДепозита И Не ДанныеОбъекта.Биржевой;
	Элементы.РасчетныйСчетВозвратаДенежныхСредств.АвтоОтметкаНезаполненного	= ЭтоРаспоряжениеНаРазмещениеДепозита И Не ДанныеОбъекта.Биржевой;
	
	Элементы.РасчетныйСчет.Доступность										= Не (ЭтоРаспоряжениеНаРазмещениеДепозита И ДанныеОбъекта.Биржевой);
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Доступность		= Не (ЭтоРаспоряжениеНаРазмещениеДепозита И ДанныеОбъекта.Биржевой);
	Элементы.РасчетныйСчетВозвратаДенежныхСредств.Доступность				= Не (ЭтоРаспоряжениеНаРазмещениеДепозита И ДанныеОбъекта.Биржевой);
	Элементы.КомандаВыбратьИсполнителяВозвратаДенежныхСредств.Доступность	= Не (ЭтоРаспоряжениеНаРазмещениеДепозита И ДанныеОбъекта.Биржевой);
	
	Элементы.ПроцентнаяСтавкаПриДосрочномЗакрытии.Видимость					= ДанныеОбъекта.ДоВостребования;
	Элементы.ПроцентнаяСтавкаПриДосрочномЗакрытии.АвтоОтметкаНезаполненного	= ДанныеОбъекта.ДоВостребования;
	
	Элементы.НомерПодтверждения.Видимость = ЗначениеЗаполнено(Форма.НомерПодтверждения);
		
	Элементы.ДекорацияАкцептовано.Видимость = (ЗначениеЗаполнено(ДанныеОбъекта.Ссылка) И РаботаСДокументами.ДокументАкцептован(ДанныеОбъекта.Ссылка, ДанныеОбъекта.Организация));	
		
	Если ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента") Тогда
		Элементы.РасчетныйСчет.Заголовок = "Р/счет списания дс";
	Иначе
		Элементы.РасчетныйСчет.Заголовок = "Р/счет";	
	КонецЕсли;
	
	ЕстьПраваНаСозданиеПодчиненныхДокументов = ПроверитьНаличиеПравНаСозданиеПодчиненныхДокументов();
	
	Если ЕстьПраваНаСозданиеПодчиненныхДокументов.МНО Тогда
		Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументМНОСоздатьНаОсновании.Видимость = Не ЭтоРаспоряжениеНаРазмещениеДепозита;
	КонецЕсли;
	
	Если ЕстьПраваНаСозданиеПодчиненныхДокументов.РазмещениеКредитногоИнструмента Тогда
		Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументРазмещениеКредитногоИнструментаСоздатьНаОсновании.Видимость = ЭтоРаспоряжениеНаРазмещениеДепозита;
	КонецЕсли;
	
	Для Каждого КомандаПечать Из Элементы.ФормаПечать.ПодчиненныеЭлементы Цикл 
		
		Если КомандаПечать.Имя = "ФормаОбработкаПечатьЗапросаСогласияНаРаспоряжениеИмуществомПечатьЗапросаСогласияНаРаспоряжениеИмуществом"
			Или КомандаПечать.Имя = "ФормаОбработкаПечатьМНОПодтверждение" 
			Или КомандаПечать.Имя = "ФормаОбработкаПечатьМНОУведомлениеОНамерении"
			Или КомандаПечать.Имя = "ФормаОбработкаРаспоряженияКомандаПечатьТикетовНаМНО" Тогда
			
			КомандаПечать.Видимость = Не ЭтоРаспоряжениеНаРазмещениеДепозита;
			
		ИначеЕсли КомандаПечать.Имя = "ФормаОбработкаРаспоряженияКомандаПечатьЗаявленийНаРазмещениеДепозитов"
			Или КомандаПечать.Имя = "ФормаОбработкаРаспоряженияКомандаПечатьПодтвержденийБанков"
			Или КомандаПечать.Имя = "ФормаОбработкаРаспоряженияКомандаПечатьПодтвержденийБанков" Тогда
			
			КомандаПечать.Видимость = ЭтоРаспоряжениеНаРазмещениеДепозита;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();

		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаРеквизитыДепозита",
			РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				"Объект.Банк,
				|Объект.ДатаРазмещения,
				|Объект.ПериодичностьВыплатыПроцентов,
				|Объект.ДоВостребования,
				|Объект.ПроцентнаяСтавкаПриДосрочномЗакрытии,
				|Объект.Субординированность,
				|Объект.Биржевой", ",", Истина, Истина));
			
		ПутьКДаннымСкрываемыхПолей.Вставить("ПроцентнаяСтавкаПриДосрочномЗакрытии", "Объект.ПроцентнаяСтавкаПриДосрочномЗакрытии");				
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаСчетИсполнительВозврата", "Объект.РасчетныйСчетВозвратаДенежныхСредств");
		ПутьКДаннымСкрываемыхПолей.Вставить("НомерПодтверждения", "НомерПодтверждения");
		
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеПравНаСозданиеПодчиненныхДокументов()
	
	ПраваНаСозданиеПодчиненныхДокументов = Новый Структура();
	
	Для Каждого ДокументМД Из Метаданные.Документы Цикл
		
		Для Каждого ДокументОснованияМД Из ДокументМД.ВводитсяНаОсновании Цикл
			
			Если ДокументОснованияМД.Имя = "Распоряжение" Тогда
				
				ПраваНаСозданиеПодчиненныхДокументов.Вставить(ДокументМД.Имя, ПравоДоступа("Добавление", ДокументМД)); 
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПраваНаСозданиеПодчиненныхДокументов;
	
КонецФункции

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьВидНумерацииОбъектовНаСервере(ДокументаСсылка, Дата, Организация, СчетДоверительногоУправления, Банк, ВидОперации)
	
	Возврат Справочники.ВидыНумерацииОбъектов.ПолучитьВидНумерацииОперации(ТипЗнч(ДокументаСсылка), Дата, Организация, СчетДоверительногоУправления, Банк, ВидОперации); 
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьНомерПодтвержденияНаСерврере(Организация, ВидНумерации, ДокСсылка, СчетДоверительногоУправления, ДатаДок)
		
	ЗарегистрированныеНомера = РегистрыСведений.НомераОбъектов.ПолучитьЗарегистрированныеНомера(
							Организация,
							ВидНумерации,
							РаботаСКоллекциями.ЗначениеВМассив(ДокСсылка),
							СчетДоверительногоУправления,
							Год(ДатаДок));
		
	Если ЗарегистрированныеНомера <> Неопределено Тогда
		Возврат РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(ЗарегистрированныеНомера[ДокСсылка]);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриЧтенииСозданииНаСервере(); 
	
КонецПроцедуры

#КонецОбласти
